Tekla Open API Reference for Tekla Structures 2025
FormBase.InitializeUnitDecimals Method
 Gets the number of decimals Tekla Structures uses for displaying its units and initializes the Tekla.Structures.Datatype classes to use them.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool InitializeUnitDecimals()
Public Shared Function InitializeUnitDecimals As Boolean
Return Value
Type: Boolean
True if successful. False if failed.
See Also
Reference
FormBase Class
Tekla.Structures.Dialog Namespace